# 1. Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
# до минуты: <s> сек;
# * до часа: <m> мин <s> сек;
# * до суток: <h> час <m> мин <s> сек;
# * *до месяца, до года, больше года: по аналогии.

duration = int(input('Введите количество секунд: '))

years = duration // 31556926
months = (duration % 31556926) // 2629743
weeks = ((duration % 31556926) % 2629743) // 604800
days = (((duration % 31556926) % 2629743) % 604800) // 86400
hours = ((((duration % 31556926) % 2629743) % 604800) % 86400) // 3600
minutes = (((((duration % 31556926) % 2629743) % 604800) % 86400) % 3600) // 60
seconds = (((((duration % 31556926) % 2629743) % 604800) % 86400) % 3600) % 60

print(years, 'лет', months, 'месяцев', weeks, 'недель', days, 'дней', hours, 'часов', minutes, 'минут', seconds, 'секунд')