# 4 Дан список, содержащий искажённые данные с должностями и именами
# сотрудников:
# ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь'
# ' высшего разряда нИКОЛАй', 'директор аэлита']
#
# Известно, что имя сотрудника всегда в конце строки.
# Сформировать из этих имён и вы  вести на экран фразы вида:
# 'Привет, Игорь!' Подумать, как получить имена сотрудников
# из элементов списка, как привести их к корректному виду. Можно ли
# при этом не создавать новый список?

workers_list = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА',
                'токарь высшего разряда нИКОЛАй','директор аэлита']
workers_str = ' '.join(workers_list)
workers_str = workers_str.lower()
workers_list = workers_str.split(' ')
workers_list[1] = workers_list[1].capitalize()
workers_list[4] = workers_list[4].capitalize()
workers_list[-1] = workers_list[-1].capitalize()
workers_list[-3] = workers_list[-3].capitalize()
print('Привет', workers_list[1])
print('Как дела', workers_list[-1], '?')
print('Ты сегодня хорошо выглядишь,', workers_list[4])
